***messages***

:STRINGS

; These are strings for prompts proposing users to choose from several
; options defined by words. Every such word is started from _.
; In every word the first character not used yet by previous words
; is assigned as hotkey. It is necessary to make such character
; uppercase, so users will know what to enter for every choice.
MYesNo                         "_Oui_Non"
MYesNoAll                      "_Oui_Non_Tous"
MYesNoAllQ                     "_Oui_Non_Tous_Jamais_Quitter"
MYesNoAllRenQ                  "_Oui_Non_Tous_Jamais_Renommer_Quitter"
MContinueQuit                  "_Continuer_Quitter"
MRetryAbort                    "_Réessayer_Abandonner"
MIgnoreAllRetryQuit            "_Ignorer_Ignorer tout_Réessayer_Quitter"

MCopyright                     "\nRAR %s   Copyright (c) 1993-%d Alexander Roshal   %d %s %d"
MRegTo                         "\nLicence accordée à %s\n"
MShare                         "\nVersion de démonstration         Pour obtenir de l'aide, saisissez 'rar -?'\n"
MRegKeyWarning                 "\nLa clé de licence disponible est valide uniquement pour %s\n"
MUCopyright                    "\nUNRAR %s Freeware      Copyright (c) 1993-%d Alexander Roshal\n"
MBeta                          "bêta"
Mx86                           "x86"
Mx64                           "x64"
MMonthJan                      "Jan"
MMonthFeb                      "Fév"
MMonthMar                      "Mar"
MMonthApr                      "Avr"
MMonthMay                      "Mai"
MMonthJun                      "Jui"
MMonthJul                      "Jul"
MMonthAug                      "Aoû"
MMonthSep                      "Sep"
MMonthOct                      "Oct"
MMonthNov                      "Nov"
MMonthDec                      "Déc"
MRARTitle1                     "\nUtilisation :     rar <commande> -<paramètre 1> -<paramètre N> <archive> <fichiers...>"
MUNRARTitle1                   "\nUtilisation :     unrar <commande> -<paramètre 1> -<paramètre N> <archive> <fichiers...>"
MRARTitle2                     "\n<@listfiles...> <chemin_extraction\\>"
MCHelpCmd                      "\n\n<Commandes>"
MCHelpCmdA                     "\n  a             Ajouter des fichiers à l'archive"
MCHelpCmdC                     "\n  c             Ajouter un commentaire à l'archive"
MCHelpCmdCH                    "\n  ch           Modifier les paramètres d'archivage"
MCHelpCmdCW                    "\n  cw           Ecrire les commentaires de l'archive dans le fichier"
MCHelpCmdD                     "\n  d             Supprimer les fichiers de l'archive"
MCHelpCmdE                     "\n  e             Extraire les fichier sans les chemins archivés"
MCHelpCmdF                     "\n  f              Actualiser les fichiers dans l'archive"
MCHelpCmdI                     "\n  i[par]=<str>  Rechercher une chaîne de caractères dans les archives"
MCHelpCmdK                     "\n  k             Verrouiller l'archive"
MCHelpCmdL                     "\n  l[t[a],b]     Répertorie le contenu de l'archive [technical[all], bare]"
MCHelpCmdM                     "\n  m[f]          Déplacer vers l'archive [fichiers uniquement]"
MCHelpCmdP                     "\n  p              Imprimer le fichier dans la sortie standard (stdout)"
MCHelpCmdR                     "\n  r               Réparer l'archive"
MCHelpCmdRC                    "\n  rc             Reconstruire les volumes manquants"
MCHelpCmdRN                    "\n  rn             Renommer les fichiers archivés"
MCHelpCmdRR                    "\n  rr[N]          Ajouter l'enregistrement de restauration des données"
MCHelpCmdRV                    "\n  rv[N]         Créer des volumes de restauration"
MCHelpCmdS                     "\n  s[nom|-]    Convertir l'archive en (ou depuis) SFX"
MCHelpCmdT                     "\n  t               Tester les fichiers de l'archive"
MCHelpCmdU                     "\n  u              Mettre les fichiers de l'archive à jour"
MCHelpCmdV                     "\n  v[t[a],b]     Répertorie en détail ne contenu de l'archive [technical[all],bare]"
MCHelpCmdX                     "\n  x              Extraire les fichiers avec le chemin d'accès complet"
MCHelpSw                       "\n\n<Paramètres>"
MCHelpSwm                      "\n  -             Interrompre la vérification des paramètres"
MCHelpSwAT                     "\n  @[+]          Désactiver [activer] listes de fichiers"
MCHelpSwAC                     "\n  ac            Effacer l'attribut Archive après la compression ou l'extraction"
MCHelpSwAD                     "\n  ad[1,2]       Autre chemin de destination"
MCHelpSwAG                     "\n  ag[format]    Générer un nom d'archive comportant l'heure et la date"
MCHelpSwAI                     "\n  ai            Ignorer les attributs des fichiers"
MCHelpSwAO                     "\n  ao            Ajouter les fichiers avec l'attribut Archive"
MCHelpSwAP                     "\n  ap<chemin d'accès>      Définir le chemin d'accès dans l'archive"
MCHelpSwAS                     "\n  as            Synchroniser le contenu des archives"
MCHelpSwCm                     "\n  c-            Désactiver l'affichage des commentaires"
MCHelpSwCFGm                   "\n  cfg-          Désactiver la lecture de la configuration"
MCHelpSwCL                     "\n  cl            Convertir les noms en minuscules"
MCHelpSwCU                     "\n  cu            Convertir les noms en majuscules"
MCHelpSwDF                     "\n  df            Supprimer les fichiers après archivage"
MCHelpSwDH                     "\n  dh            Ouvrir les fichiers partagés"
MCHelpSwDR                     "\n  dr            Déplacer les fichiers dans la corbeille"
MCHelpSwDS                     "\n  ds            Désactiver le tri par nom pour l'archive compacte"
MCHelpSwDW                     "\n  dw            Supprimer les fichiers définitivement"
MCHelpSwEa                     "\n  e[+]<attr>    Définir les attributs d'exclusion et d'inclusion de fichiers"
MCHelpSwED                     "\n  ed            Ne pas ajouter de dossiers vides"
MCHelpSwEP                     "\n  ep            Exclure les chemins des noms"
MCHelpSwEP1                    "\n  ep1           Exclure le dossier racine des noms"
MCHelpSwEP2                    "\n  ep2           Développer les chemins"
MCHelpSwEP3                    "\n  ep3           Développer les chemins avec la lettre du disque"
MCHelpSwEP4                    "\n  Ep4<chemin>   exclure le préfixe du chemin des noms"
MCHelpSwF                      "\n  f             Actualiser les fichiers"
MCHelpSwHP                     "\n  hp[motdepasse]  Chiffrer les données et les en-têtes du fichier"
MCHelpSwHT                     "\n  ht[b|c]       Sélectionne le type de hash [BLAKE2,CRC32] pour la somme de contrôle"
MCHelpSwIDP                    "\n  id[c,d,n,p,q] Afficher ou désactiver les messages"
MCHelpSwIEML                   "\n  ieml[addr]    Envoyer l'archive par e-mail"
MCHelpSwIERR                   "\n  ierr          Envoyer tous les messages comme erreur standard"
MCHelpSwILOG                   "\n  ilog[nom]    Consigner les erreurs dans le fichier journal"
MCHelpSwINUL                   "\n  inul          Désactiver tous les messages"
MCHelpSwIOFF                   "\n  ioff[n]       Arrêter le PC après l'opération"
MCHelpSwISND                   "\n  isnd[-]       Contrôler les sons des notifications"
MCHelpSwIVER                   "\n  iver          Afficher le numéro de version"
MCHelpSwK                      "\n  k             Verrouiller l'archive"
MCHelpSwKB                     "\n  kb            Conserver les fichiers extraits endommagés"
MCHelpSwLog                    "\n  log[f][=nom] Consigne les noms dans le journal"
MCHelpSwMn                     "\n  m<0..5>       Configurer le degré de compression (0-store...3-par défaut...5-maximal)"
MCHelpSwMA                     "\n  ma[4|5]       Définir une version de format d'archivage"
MCHelpSwMC                     "\n  mc<par>       Définir les paramètres avancés de compression"
MCHelpSwMD                     "\n  md<n>[k,m,g]  Taille du dictionnaire en Ko, Mo or Go"
MCHelpSwME                     "\n  me[par]        définir les paramètres de compression"
MCHelpSwMS                     "\n  ms[ext;ext]   Indiquer les types de fichier à stocker"
MCHelpSwMT                     "\n  mt<tâches>   Définir le nombre de tâches"
MCHelpSwN                      "\n  n<file>       Filtrer les fichiers inclus"
MCHelpSwNa                     "\n  n@            Lire les masques de filtres supplémentaires depuis stdin"
MCHelpSwNal                    "\n  n@<list>      Lire les masques de filtres supplémentaires depuis la liste des fichiers"
MCHelpSwO                      "\n  o[+|-]        Définir le mode de remplacement"
MCHelpSwOC                     "\n  oc            Définir l'attribut de compression NTFS"
MCHelpSwOH                     "\n  oh            Enregistrer les liens en dur au lieu du fichier"
MCHelpSwOI                     "\n  oi[0-4][:min] Enregistrer les fichiers identiques en tant que références"
MCHelpSwOL                     "\n  ol[a]         Traiter les liens symboliques comme comme le lien [chemins absolus]"
MCHelpSwONI                    "\n  oni           Autoriser les noms potentiellement incompatibles"
MCHelpSwOP                     "\n  op<chemin>    définir le chemin de sortie des fichiers extraits"
MCHelpSwOR                     "\n  or            Renommer les fichiers automatiquement"
MCHelpSwOS                     "\n  os            Enregistrer les flux NTFS"
MCHelpSwOW                     "\n  ow           Sauvegarder ou restaurer le propriétaire et le groupe du fichier"
MCHelpSwP                      "\n  p[mot de passe]   Définir le mot de passe"
MCHelpSwQO                     "\n  qo[-|+]       Ajouter des informations d'ouverture rapide [aucune|forcer]"
MCHelpSwR                      "\n  r             Sous-dossiers récurrents"
MCHelpSwRm                     "\n  r-            Désactiver la récursivité"
MCHelpSwR0                     "\n  r0            Sous-dossiers récurrents pour les noms avec joker uniquement"
MCHelpSwRI                     "\n  ri<P>[:<S>]   Configurer la priorité (0-défaut,1-min..15-max) et le temps d'attente en ms"
MCHelpSwRR                     "\n  rr[N]          Ajouter l'enregistrement de restauration des données"
MCHelpSwRV                     "\n  rv[N]         Créer des volumes de restauration"
MCHelpSwS                      "\n  s[<N>,v[-],e] Créer une archive compacte"
MCHelpSwSm                     "\n  s-            Désactiver l'archivage compacte"
MCHelpSwSC                     "\n  sc<jeu_caractères>[objets]  Définir le jeu de caractères"
MCHelpSwSFX                    "\n  sfx[nom]     Créer une archive SFX"
MCHelpSwSI                     "\n  si[nom]      Lire les données depuis l'entrée standard (stdin)"
MCHelpSwSL                     "\n  sl<taille>      Traite les fichiers avec une taille inférieure à celle spécifiée"
MCHelpSwSM                     "\n  sm<taille>      Traite les fichiers avec une taille supérieure à celle spécifiée"
MCHelpSwT                      "\n  t             Tester les fichiers archivés"
MCHelpSwTK                     "\n  tk            Garder l'heure d'origine de l'archive"
MCHelpSwTL                     "\n  tl            Définir l'heure de l'archive selon le dernier fichier"
MCHelpSwTN                     "\n  tn[mcao]<t>  Traiter les fichiers postérieurs à <t> heure"
MCHelpSwTO                     "\n  to[mcao]<t>  Traiter les fichiers antérieurs à <t> heure"
MCHelpSwTA                     "\n  ta[mcao]<d>  Traiter les fichiers modifiés après la <d> date YYYYMMDDHHMMSS"
MCHelpSwTB                     "\n  tb[mcao]<d>  Traiter les fichiers modifiés avant la <d> date YYYYMMDDHHMMSS"
MCHelpSwTS                     "\n  ts[m,c,a,p]     Sauvegarder ou restaurer la date (modification, création, accès, conservation)"
MCHelpSwU                      "\n  u             Mettre à jour les fichiers"
MCHelpSwV                      "\n  v             Créer les volumes avec la détection automatique de la taille ou lister tous les volumes"
MCHelpSwVUnr                   "\n  v             Répertorier tous les volumes"
MCHelpSwVn                     "\n  v<taille>[k,o]  Créer les volumes dont la taille=<taille>*1000 [*1024, *1]"
MCHelpSwVD                     "\n  vd            Effacer le contenu du disque avant de créer le volume"
MCHelpSwVER                    "\n  ver[n]        Contrôle de la version du fichier"
MCHelpSwVN                     "\n  vn            Utiliser l'ancien style pour l'affectation du nom de volume"
MCHelpSwVP                     "\n  vp            Observer une pause après chaque volume"
MCHelpSwW                      "\n  w<path>       Définir un dossier de travail"
MCHelpSwX                      "\n  x<file>       Exclure le fichier spécifié"
MCHelpSwXa                     "\n  x@            Lire les noms des fichiers à exclure du flux d'entrée (stdin)"
MCHelpSwXal                    "\n  x@<list>      Exclure les fichiers répertoriés dans la liste définie de fichiers"
MCHelpSwY                      "\n  y             Répondre Oui à toutes les questions"
MCHelpSwZ                      "\n  z<fichier>    Lire le commentaire de l'archive depuis le fichier"
MBadArc                        "\n  ERREUR : Archive erronée%s\n"
MAskPsw                        "Saisir le mot de passe (ne sera pas affiché)"
MAskPswFor                     "\n  Saisir le mot de passe (ne sera pas affiché) pour %s : "
MReAskPsw                      "\n  Saisir le mot de passe à nouveau : "
MNotMatchPsw                   "\n  ERREUR : Les mots de passe ne correspondent pas\n"
MErrWrite                      "Erreur d'écriture dans le fichier %s"
MErrRead                       "Erreur de lecture dans le fichier %s"
MErrSeek                       "Erreur de recherche dans le fichier %s"
MErrFClose                     "Impossible de fermer le fichier %s"
MErrOutMem                     "Mémoire insuffisante"
MErrBrokenArc                  "Archive corrompue : utiliser la commande 'Réparer'"
MProgAborted                   "Programme arrêté"
MErrRename                     "\nImpossible de renommer %s en %s"
MAbsNextVol                    "\nVolume %s introuvable"
MBreak                         "\nArrêt par l'utilisateur\n"
MAskCreatVol                   "\nCréer le volume suivant ?"
MAskNextDisk                   "\nDisque plein. Insérer le suivant"
MCreatVol                      "\n\nCréation de l'%sarchive %s\n"
MAskNextVol                    "\nInsérez le disque avec %s"
MTestVol                       "\n\nTest de l'archive %s\n"
MExtrVol                       "\n\nExtraction depuis %s\n"
MConverting                    "\nConversion de %s"
MCvtToSFX                      "\nConvertir les archives en SFX"
MCvtFromSFX                    "\nSuppression du module SFX"
MNotSFX                        "\n%s n'est pas une archive SFX"
MNotRAR                        "\n%s n'est pas une archive RAR"
MNotFirstVol                   "\n%s n'est pas le premier volume"
MCvtOldFormat                  "\n%s : impossible de convertir une archive en SFX avec l'ancien format"
MCannotCreate                  "\nImpossible de créer %s"
MCannotOpen                    "\nImpossible d'ouvrir %s"
MUnknownMeth                   "\nMéthode inconnue dans %s"
MNewRarFormat                  "\nFormat d'archive non pris en charge. Mettez RAR à jour vers une version plus récente."
MOk                            " OK"
MDone                          "\nTerminé"
MLockingArc                    "\nVerrouillage de l'archive"
MNotMdfOld                     "\n\nERREUR : Impossible de modifier une archive ayant l'ancien format"
MNotMdfLock                    "\n\nERREUR : Archive verrouillée"
MNotMdfVol                     "\n\nERREUR : Impossible de modifier le volume"
MPackAskReg                    "\nVersion d'évaluation. Merci de vous enregistrer.\n"
MCreateArchive                 "\nCréation de l'%sarchive %s\n"
MUpdateArchive                 "\nMise à jour de l'%sarchive %s\n"
MAddSolid                      "compacte "
MAddFile                       "\nAjout de %-58s     "
MUpdFile                       "\nMise à jour de %-58s     "
MAddPoints                     "\n...       %-58s     "
MMoveDelFiles                  "\n\nSuppression des fichiers %s..."
MMoveDelDirs                   "et dossiers"
MMoveDelFile                   "\nSuppression de %-30s"
MMoveDeleted                   "    supprimé"
MMoveNotDeleted                "    NON SUPPRIME"
MClearAttrib                   "\n\nEffacement des attributs..."
MMoveDelDir                    "\nSuppression du dossier %-30s"
MWarErrFOpen                   "\nAVERTISSEMENT : Impossible d'ouvrir %d %s"
MErrOpenFiles                  "fichiers"
MErrOpenFile                   "fichier"
MAddNoFiles                    "\nAVERTISSEMENT : Pas de fichier"
MMdfEncrSol                    "\n%s : chiffré"
MAddAnalyze                    "\nAnalyse des fichiers archivés : "
MRepacking                     "\nNouvelle compression des fichiers archivés : "
MCRCFailed                     "\n%-20s - erreur de somme de contrôle"
MExtrTest                      "\n\nTest de l'archive %s\n"
MExtracting                    "\n\nExtraction depuis %s\n"
MUseCurPsw                     "\n%s : utiliser le mot de passe actuel ?"
MCreatDir                      "\nCréation de %-56s"
MExtrSkipFile                  "\n%-56s ignoré"
MExtrTestFile                  "\nTest de %-56s"
MExtrFile                      "\nExtraction de %-56s"
MExtrPoints                    "\n...         %-56s"
MExtrErrMkDir                  "\nImpossible de créer le dossier %s"
MExtrPrinting                  "\n------ Impression de %s\n\n"
MEncrBadCRC                    "\nErreur de somme de contrôle dans le fichier chiffré %s. Fichier corrompu ou mot de passe erroné."
MExtrNoFiles                   "\nAucun fichier à extraire"
MExtrAllOk                     "\nTout est OK"
MExtrTotalErr                  "\nNombre total d'erreurs : %ld"
MAskReplace                    "\n\nSouhaitez-vous remplacer le fichier existant %s\n%6s octets, modifié le %s\npar le nouveau\n%6s octets, modifié le %s\n"
MAskOverwrite                  "\nRemplacer %s ?"
MAskNewName                    "\nSaisissez le nouveau nom : "
MHeaderBroken                  "\nUn en-tête est corrompu"
MMainHeaderBroken              "\nL'en-tête de l'archive principale est corrompu"
MLogFileHead                   "\n%s : l'en-tête du fichier est corrompu"
MLogProtectHead                "L'en-tête des données de restauration est corrompu"
MReadStdinCmt                  "\nLecture du commentaire depuis le flux d'entrée\n"
MReadCommFrom                  "\nLecture du commentaire depuis %s"
MDelComment                    "\nSuppression du commentaire de %s"
MAddComment                    "\nAjout du commentaire à %s"
MFCommAdd                      "\nAjout des commentaires aux fichiers"
MAskFComm                      "\n\nLecture du commentaire depuis %s : %s depuis stdin\n"
MLogCommBrk                    "\nLe commentaire de l'archive est corrompu"
MCommAskCont                   "\nAppuyez sur 'Entrée' pour continuer ou sur 'Q' pour quitter :"
MWriteCommTo                   "\nEcrire un commentaire dans %s"
MCommNotPres                   "\nLe commentaire n'est pas présent"
MDelFrom                       "\nSuppression depuis %s"
MDeleting                      "\nSuppression de %s"
MEraseArc                      "\nEffacement de l'archive vide %s"
MNoDelFiles                    "\nAucun fichier à supprimer"
MLogTitle                      "--------  %2d %s %d, archive %s"
MPathTooLong                   "\nERREUR : Chemin d'accès trop long\n"
MListArchive                   "Archive"
MListDetails                   "Détails"
MListSolid                     "compacte"
MListSFX                       "SFX"
MListVolume                    "volume"
MListRR                        "enregistrement de restauration"
MListLock                      "verrouiller"
MListEnc                       "chiffré"
MListEncHead                   "en-têtes chiffrés"

; Titles for 'L' and 'V' commands.
MListTitleL                    " Attributs      Taille    Date   Heure   Nom"
MListTitleV                    " Attributs      Taille    Ratio de compression   Date   Heure   Somme de contrôle  Nom"

; Titles for multiline list output.
MListName                      "Nom"
MListType                      "Type"
MListFile                      "Fichier"
MListDir                       "Dossier"
MListUSymlink                  "Lien symbolique UNIX"
MListWSymlink                  "Lien symbolique Windows"
MListJunction                  "Point de jonction NTFS"
MListHardlink                  "Lien en dur"
MListCopy                      "Référence fichier"
MListStream                    "Flux de données de remplacement NTFS"
MListTarget                    "Cible"
MListSize                      "Taille"
MListPacked                    "Taille compressée"
MListRatio                     "Taux"
MListMtime                     "mtime"
MListCtime                     "ctime"
MListAtime                     "atime"
MListModified                  "Modifié"
MListCreated                   "Créé"
MListAccessed                  "Accédé"
MListAttr                      "Attributs"
MListFlags                     "Drapeaux"
MListCompInfo                  "Compression"
MListHostOS                    "Système d'exploitation hôte"
MListFileVer                   "Version du fichier"
MListService                   "Service"
MListUOHead                    "\n  Propriétaire/Groupe des données Unix :    %-14s %-14s"
MListNTACLHead                 "\n  Données de sécurité NTFS"
MListStrmHead                  "\n  Flux NTFS : %s"
MListUnkHead                   "\n  Type d'en-tête secondaire inconnu : 0x%04x"
MFileComment                   "\nCommentaire : "
MYes                           "Oui"
MNo                            "Non"
MListNoFiles                   "  0 fichier\n"
MRprReconstr                   "\nReconstruction de %s"
MRprBuild                      "\nConstruction de %s"
MRprOldFormat                  "\nImpossible de réparer l'archive avec l'ancien format"
MRprFind                       "\n%s trouvé"
MRprAskIsSol                   "\nL'en-tête de l'archive est corrompu. Marquer l'archive comme compacte ?"
MRprNoFiles                    "\nAucun fichier trouvé"
MLogUnexpEOF                   "\nFin de l'archive incorrecte"
MRepAskReconst                 "\nReconstruire la structure de l'archive ?"
MRRSearch                      "\nRecherche de l'enregistrement de restauration"
MAnalyzeFileData               "\nAnalyse des données du fichier"
MRecRNotFound                  "\nEnregistrement de récupération des données introuvable"
MRecRFound                     "\nEnregistrement de récupération des données trouvé"
MRecSecDamage                  "\nSecteur %ld (offsets %lX...%lX) endommagé"
MRecCorrected                  " - données récupérées"
MRecFailed                     " - impossible de récupérer les données"
MAddRecRec                     "\nAjout de l'enregistrement de restauration des données"
MEraseForVolume                "\n\nEffacement du contenu du lecteur %c :\n"
MGetOwnersError                "\nAVERTISSEMENT : Impossible de récupérer le propriétaire et le groupe de %s\n"
MErrGetOwnerID                 "\nAVERTISSEMENT : Impossible de récupérer l'ID %s du propriétaire\n"
MErrGetGroupID                 "\nAVERTISSEMENT : Impossible de récupérer l'ID %s du groupe\n"
MOwnersBroken                  "\nERREUR : Les données du groupe et du propriétaire de %s sont corrompues\n"
MSetOwnersError                "\nAVERTISSEMENT : Impossible de définir le propriétaire et le groupe de %s\n"
MErrLnkRead                    "\nAVERTISSEMENT : Impossible de lire le lien symbolique de %s"
MSymLinkExists                 "\nAVERTISSEMENT : Le lien symbolique %s existe déjà"
MAskRetryCreate                "\nImpossible de créer %s. Essayer à nouveau ?"
MDataBadCRC                    "\n%-20s : erreur de somme de contrôle des données compressées dans le volume %s"
MFileRO                        "\n%s est en lecture seule"
MACLGetError                   "\nAVERTISSEMENT : Impossible d'obtenir les données de sécurité de %s\n"
MACLSetError                   "\nAVERTISSEMENT : Impossible de définir les données de sécurité de %s\n"
MACLBroken                     "\nERREUR : Les données de sécurité de %s sont corrompues\n"
MACLUnknown                    "\nAVERTISSEMENT : Format des données de sécurité inconnu %s\n"
MStreamBroken                  "\nERREUR : Les données de flux de %s sont corrompues\n"
MStreamUnknown                 "\nAVERTISSEMENT : Format des données de flux inconnu %s\n"
MInvalidName                   "\nERREUR : Nom de fichier non valide %s"
MProcessArc                    "\n\nTraitement de l'archive %s"
MCorrectingName                "\nAVERTISSEMENT : Tentative de correction du nom de répertoire ou de fichier non valide"
MUnpCannotMerge                "\nAVERTISSEMENT : Vous devez lancer l'extraction depuis un volume précédent pour décompresser %s"
MUnknownOption                 "\nERREUR : Option inconnue : %s"
MSubHeadCorrupt                "\nERREUR : En-tête de données corrompu et ignoré"
MSubHeadUnknown                "\nAVERTISSEMENT : Format d'en-tête de données inconnu et ignoré"
MSubHeadDataCRC                "\nERREUR : Bloc de données %s corrompu"
MSubHeadType                   "\nType d'en-tête des données : %s"
MScanError                     "\nImpossible de lire le contenu de %s"
MNotVolume                     "\n%s n'est pas un volume"
MRecVolDiffSets                "\nERREUR : %s et %s appartiennent à des ensembles distincts"
MRecVolMissing                 "\n%d volumes manquants"
MRecVolFound                   "\n%d volumes de restauration trouvés"
MRecVolAllExist                "\nRien à reconstruire"
MRecVolCannotFix               "\nReconstruction impossible"
MReconstructing                "\nReconstruction..."
MCreating                      "\nCréation de %s"
MRenaming                      "\n%s renommé en %s"
MNTFSRequired                  "\nErreur d'écriture : seul le système de fichiers NTFS prend en charge les fichiers de plus de 4 Go"
MFAT32Size                     "\nAVERTISSEMENT : Le système de fichiers FAT32 ne prend pas en charge les fichiers de plus de 4 Go"
MErrChangeAttr                 "\nAVERTISSEMENT : Impossible de changer les attributs de %s"
MWrongSFXVer                   "\nERREUR : le module SFX par défaut ne prend pas en charge les archives RAR %d.%d"
MHeadEncMismatch               "\nImpossible de modifier le mode de chiffrement de l'en-tête dans une archive déjà chiffrée"
MCannotEmail                   "\nImpossible d'envoyer le fichier %s par e-mail"
MCopyrightS                    "\nArchive SFX RAR"
MSHelpCmd                      "\n\n<Commandes>"
MSHelpCmdE                     "\n  -x      Extraire depuis l'archive (par défaut)"
MSHelpCmdT                     "\n  -t      Tester les fichiers de l'archive"
MSHelpCmdV                     "\n  -v      Liste détaillée du contenu d'une archive"
MRecVolLimit                   "\nLe nombre total de volumes usuels et de restauration ne doit pas dépasser %d"
MVolumeNumber                  "%d volume"
MCannotDelete                  "\nImpossible de supprimer %s"
MRecycleFailed                 "\nImpossible de déplacer certains fichiers et dossiers vers la corbeille"
MCalcCRC                       "\nCalcul de la somme de contrôle"
MTooLargeSFXArc                "\nL'archive SFX est trop grande. Windows ne peut pas lancer de fichier exécutable d'une taille supérieure à 4 Go."
MCalcCRCAllVol                 "\nCalcul des sommes de contrôle de tous les volumes."
MNotEnoughDisk                 "\nERREUR : Espace disque insuffisant pour %s."
MNewerRAR                      "\nUne nouvelle version de RAR est peut-être nécessaire."
MUnkEncMethod                  "\nMéthode de chiffrement inconnue dans %s"
MWrongPassword                 "\nLe mot de passe indiqué n'est pas correct."
MWrongFilePassword             "\nMot de passe incorrect pour %s"
MAreaDamaged                   "\nOctets %d corrompus à %08x %08x"
MBlocksRecovered               "\n%u blocs ont été récupérés, %u blocs ont été déplacés"
MRRDamaged                     "\nL'enregistrement de restauration est corrompu."
MTestingRR                     "\nTest de l'enregistrement de récupération"
MFailed                        "Echec"
MIncompatSwitch                "\nLe commutateur %s n'est pas pris en charge pour le format d'archive %d.x RAR."
MSearchDupFiles                "\nRecherche de fichiers identiques"
MNumFound                      "%d trouvé."
MUnknownExtra                  "\nChamp supplémentaire inconnu dans %s."
MCorruptExtra                  "\nChamp supplémentaire corrompu %s dans %s."
MCopyError                     "\nImpossible de copier %s vers %s."
MCopyErrorHint                 "\nVous devez décompresser l'intégralité de l'archive pour créer les entrées de références des fichiers."
MCopyingData                   "\nCopie des données"
MErrCreateLnkS                 "\nImpossible de créer le lien symbolique %s"
MErrCreateLnkH                 "\nImpossible de créer le lien dur %s"
MErrLnkTarget                  "\nVous devez d'abord décompresser la cible du lien"
MNeedAdmin                     "\nVous devriez peut-être exécuter RAR avec des droits d'administrateur"
MDictOutMem                    "\nLa quantité de mémoire n'est pas suffisante pour un dictionnaire de %d Mo. La valeur a été remplacée par %d Mo."
MUseSmalllerDict               "\nVeuillez utiliser un dictionnaire de compression plus petit."
MOpenErrAtime                  "\nPour ouvrir ce fichier, vous devrez éventuellement supprimer le commutateur -tsp."
MErrReadInfo                   "\nChoisissez "Ignorer" pour continuer avec la partie de fichier déjà lue, "Ignorer tout" pour le faire pour toutes les erreurs de lecture, "Réessayer" pour recommencer la lecture et "Quitter" pour abandonner."
MErrReadTrunc                  "\n%s est archivé de manière incomplète en raison d'une erreur de lecture.\n"
MErrReadCount                  "\n%u fichiers sont archivés de manière incomplète en raison d'erreurs de lecture."
MDirNameExists                 "\nUn répertoire portant ce nom existe déjà"
MStdinNoInput                  "\nLa saisie au clavier n'est pas autorisée lors de la lecture des données depuis stdin"
MTruncPsw                      "\nLe mot de passe dépasse la longueur maximale autorisée de %u caractères et sera tronqué."
MAdjustValue                   "\nRéglage de la valeur %s à %s."
MOpFailed                      "\nL'opération a échoué"
MSkipEncArc                    "\nIgnorer l’archive chiffrée %s"
